#include <iostream>
using namespace std;

int main()
{
	int i, j;
	// Змінні для опису характеристик масивів. 
	// m1 — кількість рядків, m2 — кількість стовпців
	int m1 = 5, m2 = 5;
	/* Організація двовимірного динамічного масиву
	проводиться у два етапи.
	Спочатку створюється одновимірний масив
	покажчиків, а потім кожному елементу цього
	масиву присвоюється адреса одновимірного масиву.
	Для характеристик розмірів масивів не потрібні
	константні вирази.*/
	int** pArr = new int* [m1];

	for (i = 0; i < m1; i++)
	{
		pArr[i] = new int[m2];
	}

	// Доступ до елементів масиву виконується як звичайно
	pArr[3][3] = 100;
	cout << pArr[3][3] << "\n";
	// Послідовне видалення двовимірного масиву... 
	for (i = 0; i < m1; i++)
	{
		delete[]pArr[i];
	}

	delete[]pArr;

	return 0;
}