#include <iostream>
using namespace std;

int main()
{
	int x = 10;
	int y = 5;

	int* px;
	int* py;

	// Записуємо адресу змінної x у px
	px = &x;

	// Відображаємо адресу x через покажчик та операцію взяття адреси
	cout << px << " " << &x << endl;
	// Відображаємо значення x через змінну й операцію розіменування на екрані 10 10 
	cout << *px << " " << x << endl;
	// Змінюємо значення змінної x використовуємо операцію розіменування
	*px = 99;
	// Відображаємо нове значення x через змінну й операцію розіменування на екрані відобразиться 99 99
	cout << *px << " " << x << endl << endl;
	// Записуємо адресу змінної y в py
	py = &y;
	// Відображаємо адресу y через покажчик та операцію взяття адреси
	cout << py << " " << &y << endl;
	// Відображаємо значення y через змінну й операцію розіменування на екрані 5 5
	cout << *py << " " << y << endl;
	// записуємо значення адреси з px у py тепер обидва покажчики вказують на x
	py = px;
	// Відображаємо значення x через змінну і два покажчики на екрані 99 99 99
	cout << *px << " " << *py << " " << x << endl << endl;
	return 0;
}
