#include <iostream>
using namespace std;

int main()
{
	const int size = 5;
	int arr[size] = { 33, 44, 7, 8, 9 };

	// записуємо адресу нульового елемента масиву в покажчик
	int* ptr = &arr[0];
	// Показуємо значення нульового елемента масиву через розіменування покажчика.
	// На екрані 33
	cout << *ptr << endl;

	/*
	Показуємо значення першого елемента масиву через розіменування покажчика.
	Ми додаємо зсув за адресою на один елемент після чого виконуємо розіменування.
	Адреса всередині покажчика не змінюється.
	На екрані 44
	*/
	cout << *(ptr + 1) << endl;

	/*
	Виконуємо зсув на один елемент цілого типу вперед і записуємо нову адресу в покажчик ptr.
	Фактично ця операція виглядає так
	ptr = ptr + 1 * sizeof(int)
	Тепер у покажчику міститься адреса першого елемента. 
	Можна було також написати ptr++;
	*/
	ptr = ptr + 1;
	/*
	Показуємо значення першого елемента масиву через розіменування покажчика.
	На екрані 44
	*/
	cout << *ptr << endl;

	return 0;
}