#include <iostream>
using namespace std;

int main() {
	int A, B; // оголосимо дві змінні
	// просимо користувача ввести в них дані
	cout << "Enter your first number:\n";
	cin >> A;
	cout << "Enter your second number:\n"
		cin >> B;
	
	/* У цьому випадку, якщо В не дорівнюватиме нулю, виконається та команда, яка стоїть після
	знака питання, і на екрані з'явиться результат ділення. В іншому випадку, виконається
	команда, яка стоїть після двокрапки, і на екрані буде повідомлення про помилку ділення на нуль.
	*/

	(B != 0) ? 
		cout << "Result A/B=" << A << "/!" << B << "=" << A / B : 
		cout << "You can’t divide by zero!!!";
	// кінець програми
	cout << "\n The end. \n";
	return 0;
}