#include <iostream>
using namespace std;

int main() {
	int A, B; // оголосимо дв≥ зм≥нн≥ просимо користувача ввести в них дан≥
	
	cout << "Enter your first number:\n";
	cin >> A;
	cout << "Enter your second number:\n";
	cin >> B;

	// ѕрир≥внюЇмо B до нул€ ≥ перев≥р€Їмо умову, вона автоматично Ї брехнею
	if (B = 0) {// ц€ частина н≥коли не виконаЇтьс€, 
		// тому що умова завжди Ї брехнею
		cout << "You canТt divide by zero!!!";
		// пов≥домл€Їмо про помилку
	}
	else {// завжди виконуЇтьс€ ц€ частина,
		// у €к≥й A д≥литьс€ на новоспечений нуль
		/* ” цьому р€дку в≥дбудетьс€ помилка на етап≥ виконанн€, тому що комп'ютер спробуЇ
		под≥лити число на нуль */
		cout << "Result A/B=" << A << "/" << B << "=" << A / B;
	}
	cout << "\n The end. \n"; // ÷ю фразу ми не побачимо н≥коли.

	return 0;
}