#include <iostream>
using namespace std;

int a = 10;

void setA() {
	a = 99;
}

void show() {
	cout << a << endl;
}
/*
 Усередині функції глобальну змінну буде не видно,
 адже її приховує локальна змінна A
*/
void SetASecond() {
	int a = 77;
	cout << a << endl;
}
int main()
{
	/* на екрані відобразиться значення 10 з
	глобальної змінної A */
	show();
	/* записуємо в глобальну змінну значення 99 */
	setA();
	/* на екрані відобразиться значення 99 з глобальної
	змінної A */
	show();
	/* змінюємо значення локальної змінної A
	на екрані буде значення 77
	*/
	SetASecond();
	/* на екрані відобразиться значення 99 з глобальної
	змінної A */
	show();

	return 0;
}
