#include <iostream>
using namespace std;

int A = 10;

/*
 Усередині функції глобальну змінну буде не видно,
 адже її приховує локальна змінна A. Однак, якщо
 нам усе ж таки потрібно звернутися до глобальної
 змінної, будемо використовувати оператор::
*/
void test() {
	int A = 77;
	// звертаємося до локальної змінної
	// на екрані — 77
	cout << A << endl;
	// звертаємося до глобальної A
	// на екрані — 10
	cout << ::A << endl;
	// міняємо значення в глобальній змінній
	::A = 333;
}

int main()
{
	test();
	// відображається значення 333
	cout << A << endl;
	return 0;
}