/********************************************************************************/

/*Функція обчислення середнього арифметичного довільної кількості дійсних чисел */

/********************************************************************************/

#include <iostream>
#include <conio.h>
#include <stdarg.h>

double f(double, ...); // прототип функції зі змінним чисом параметрів

using namespace std;

int main()
{
	cout << "Seredne aryfmetychne 2,4,3 = " << f(2.0, 4.0, 3.0, 0.0) << endl;
	cout << "Seredne aryfmetychne 2,14,8,16 = " << f(2.0, 14.0, 8.0, 16.0, 0.0) << endl;

	_getch();

	return 0;
}

double f(double n, ...)
{
	double* p = &n; // вказівник на початок списку параметрів
	double sum = 0;
	int count = 0;

	while (*p) // поки в списку є ненульовий елемент
	{
		sum += (*p);
		p++; // переходимо на наступний параметр зі списку
		count++;
	}

	return ((sum) ? sum / count : 0);
}