#include <iostream>
using namespace std;

int main()
{
	// визначення розміру масиву
	const int size = 5;
	// створення й ініціалізація масиву даними
	int ar[size] = { 23,-11,9,-18,-25 };
	// змінна для накопичення суми
	int sum = 0;
	// цикл, що перебирає по порядку елементи масиву
	for (int i = 0;i < size;i++)
	{
		// якщо значення елемента від’ємне
		// (меньше за нуль) 
		if (ar[i] < 0)
			sum += ar[i]; // додати його значення
		// до загальної суми
	}
	// вивід значення суми на екран
	cout << "Sum = " << sum << "\n\n";
	return 0;
}
