#include <iostream>
using namespace std;

int main()
{
	// визначення кількості елементів масиву
	const int size = 5;
	// створення та ініціалізація масиву
	int ar[size] = { 23,11,9,18,25 };
	int max = ar[0]; // нехай 0 елемент буде максимальним
	int min = ar[0]; // нехай 0 елемент буде мінімальним

	// цикл перебирає елементи 
	// масиву, починаючи з одиниці
	for (int i = 1;i < size;i++)
	{
		// якщо поточний елемент менший за мінімум
		if (min > ar[i])
			// перезаписати значення мінімуму 
			min = ar[i];
		// якщо поточний елемент більший за максимум
		if (max < ar[i])
			// перезаписати значення максимуму 
			max = ar[i];
	}
	
	// вивід результату на екран 
	cout << "Max = " << max << "\n\n";
	cout << "Min = " << min << "\n\n";
	return 0;
}