// у цьому файлі містяться rand і srand
#include<stdlib.h>
#include<time.h> // у цьому файлі міститься функція time
using namespace std;

int main()
{
	// задаємо розмірність масиву 
	const int m = 3;
	const int n = 2;
	int A[m][n]; // оголошуємо двовимірний масив

	// заповнення масиву випадковими числами і вивід на екран перебираємо окремі рядки
	for (int i = 0; i < m; i++)
	{
		// перебираємо окремі елементи кожного рядка
		for (int j = 0; j < n;j++)
		{
			// ініціалізація елементів значеннями у діапазоні від 0 до 100
			A[i][j] = rand() % 100;
			// вивід значень на екран 
			cout << A[i][j] << " ";
		}
		// перехід на інший рядок матриці
		cout << "\n\n";
	}
	cout << "\n\n";

	// пошук у рядках максимального елемента перебираємо окремі рядки
	for (int i = 0; i < m; i++)
	{
		// припускаємо, що максимальним є нульовий елемент рядка
		int max = A[i][0];
		// пошук максимального елемента в поточному рядку зміна індексу стовпця для поточного рядка
		for (int j = 0; j < n; j++)
		{
			if (A[i][j] > max)
				max = A[i][j];
		}
		cout << "Max element " << i << " row=" <<
			max << endl;
	}

	return 0;
}