#include <iostream> 
using namespace std;

int main()
{
	const int size = 3;
	int ar[size]; // створення масиву з трьох елементів
	// цикл, що перебирає елементи масиву

	for (int i = 0;i < size;i++)
	{
		cout << "Enter element\n";
		/* на кожній ітерації циклу користувачеві
		підставляється елемент з індексом i для
		заповнення. Секрет у тому, що i — щоразу
		нове значення */
		cin >> ar[i];
	}
	cout << "\n\n";

	// цикл, що перебирає елементи масиву
	for (int i = 0; i < size; i++)
	{
		// вивід елемента з індексом i на екран
		cout << ar[i] << "\n";
	}

	return 0;
}